sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/requests/costumes/costume2.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:costumesRequest xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLCostumes/">
            <costumeId>2</costumeId>
        </ns2:costumesRequest>
    </S:Body>
</S:Envelope>